; domain
(define (domain blocks)
  (:requirements :strips :typing :equality
                 :universal-preconditions
                 :conditional-effects)
  (:types physob)
  (:predicates   
       (ontable ?x - physob)
       (clear ?x - physob) 
       (on ?x ?y - physob))
  
  (:action move
           :parameters (?x ?y - physob)
           :precondition (and (clear ?x) (clear ?y) (not (= ?x ?y)))
           :effect (and (on ?x ?y) 
                        (not (clear ?y)) 
                        (forall (?z - physob) (when (on ?x ?z) (and (not (on ?x ?z)) (clear ?z)))))
           )

  (:action moveToTable
           :parameters (?x - physob)
           :precondition (and (clear ?x) (exists (?y - physob) (on ?x ?y)))
           :effect (and (ontable ?x) 
                        (forall (?z - physob) (when (on ?x ?z) (and (not (on ?x ?z)) (clear ?z)))))
  )
)

; problem
(define (problem prob)
 (:domain blocks)
 (:objects A B C D E F - physob)
 (:init (clear A)(on A B)(on B C)(ontable C) (ontable D)
  (ontable F)(on E D)(clear E)(clear F)
 )
 (:goal  (and (clear F) (on F A) (on A C) (ontable C)(clear E) (on E B) 
         (on B D) (ontable D)) 
 )
 )

; plan
1. (movetotable a)
   deleted: (on a b)
   added: (ontable a) (clear b)
   goals met: 4 of 8
2. (move f a)
   deleted: (clear a)
   added: (on f a)
   goals met: 5 of 8
3. (movetotable b)
   deleted: (on b c)
   added: (ontable b) (clear c)
   goals met: 5 of 8
4. (move e c)
   deleted: (clear c) (on e d)
   added: (on e c) (clear d)
   goals met: 5 of 8
5. (move b d)
   deleted: (clear d)
   added: (on b d)
   goals met: 6 of 8
6. (move e b)
   deleted: (clear b) (on e c)
   added: (on e b) (clear c)
   goals met: 7 of 8
7. (movetotable f)
   deleted: (on f a)
   added: (clear a)
   goals met: 6 of 8
8. (move a c)
   deleted: (clear c)
   added: (on a c)
   goals met: 7 of 8
9. (move f a)
   deleted: (clear a)
   added: (on f a)
   goals met: 8 of 8
